{"Items": [{"ItemID": "1679308550", "Name": "L@@K!3 KHAKIS & 2 JEANS LADIES 4 GAP OLD NAVY", "Category": ["Clothing & Accessories", "Women", "Misses", "Casual", "Pants"], "Currently": "$9.99", "First_Bid": "$9.99", "Number_of_Bids": "0", "Bids": null, "Location": "X-MASS IS COMING..BUY YOUR GIFTS HERE!", "Country": "USA", "Started": "Dec-18-01 08:11:10", "Ends": "Dec-28-01 08:11:10", "Seller": {"UserID": "worldwide-outfitters", "Rating": "4047"}, "Description": "if (navigator.appName == 'Microsoft Internet Explorer') { if (navigator.appVersion.substring(0,1) \"); } else { document.write(\" \"); document.write(\" \"); document.write(\" \"); document.write(\" BODY { background: url(http://worldwide-outfitters.20fr.com/espacio.GIF) }\"); document.write(\" \"); document.write(\" \"); } } else { //Default to Netscape settings. document.write(\" \"); } L@@K!3 KHAKIS & 2 JEANS LADIES 4 AN INCREDIBLE DEAL!! EXCELLENT FOR ANY LADY!! This lot includes: 1 pair of wide leg OLD NAVY jeans. Inseam is 29\". 1 pair of dark OLD NAVY jean shorts. 1 pair of GAP relaxed fit, button fly khaki shorts by GAP 1 pair of OLD NAVY khakis. Inseam is 29\" 1 pair of OLD NAVY khaki pants with a pleated front. Inseam is 31\". This lot is in EXCELLENT condition!! Perfect for any lady!! Get it while you can and Happy Bidding : ) HAPPY HOLIDAYS!! WE WILL SHIP ANYWHERE IN THE USA & INTERNATIONALLY!! ** Please Note, International Customers should contact us for Exact Shipping Rates** Click Here For More Info about our Company Simple Rules: Buyer Pays Shipping & Handling: We ship Ground UPS in the Continental US (includes insurance). AK & HI orders shipped via USPS, buyer will pay charges + $3.00 handling charge. * Bidding on Multiple items can save you on shipping!! * Payment must be received no later than 10 days from the end of auction! If we do not get a response from the winning bidder, within 10 days after the auction closes, the item will be Relisted!!! Pay by: Visa/MasterCard at PayPal.Com (Click here if you are not already registered with PayPal) Money Orders at: BidPay.Com www.BidPay.com We accept US & International Customers payment with a major credit card via B id P ay . Or: Pay by Money Orders & Personal Checks GUARANTEE: * WE DO THE BEST TO DESCRIBE OUR ITEMS * IF THERE IS A COMPLAINT, OR A MISTAKE ON ANY OF OUR AUCTIONS, PLEASE EMAIL us before leaving a NEGATIVE Feedback. It is very important that you as the customer are HAPPY with your purchase(s) IF UNSATISFIED IN ANY WAY, WE OFFER A FULL REFUND. Read Our About Me Page for any additional questions Customer Service: We are a Full Time working ebay business office. Regular business hours are Mon - Fri 8 am- 4 pm Eastern Time. We do not work on the weekends, so if you do have a question over the weekend, please be patient and we will answer you 1st thing Monday Morning! Don't forget to bookmark this page or Look us up by Seller on Ebay!! Thanks and Happy Bidding! :) Make sure to check our other Auctions for great deals we update daily!!. We have Brand Name Clothing, Jeans, Shoes, as well as vintage clothing for Men, Women and Children, all sizes!! Click Here to View our other Auctions Created by eBay Seller's Assistant Pro Free Honesty Counters powered by Andale! Visit Worldwide-Outfitters today! Payment Details U.S. Shipping and Handling $8.25 Shipping Insurance per item - Sales Tax (6.000% if shipped to CT) _ Learn more about checkout Payment Instructions If there is a complaint, mistake or problem with your purchase PLEASE EMAIL us immediately before leaving a NEGATIVE feedback, so we can resolve/ refund you. It is very important to us that you as a cutomer are HAPPY with your purchase(s) email: auctions@cttel.net Telephone: 203-736-4644 Mon-Fri 9-3 EST"}, {"ItemID": "1679308791", "Name": "CHUCK TAYLOR CONVERSE ALLSTAR size 6", "Category": ["Clothing & Accessories", "Men", "Footwear", "Athletic Shoes", "Other Athletic Shoes"], "Currently": "$7.00", "First_Bid": "$7.00", "Number_of_Bids": "0", "Bids": null, "Location": "Campbellsville, KY", "Country": "USA", "Started": "Dec-18-01 08:12:44", "Ends": "Dec-25-01 08:12:44", "Seller": {"UserID": "osteofun", "Rating": "9"}, "Description": "These are khaki colored high-topped shoes. They are like new.....We cannot tell that they have ever been worn at all. please pose any questions to the seller before bidding. All payment is via paypal/billpoint only. Free Honesty Counters powered by Andale! Payment Details U.S. Shipping and Handling $4.50 Shipping Insurance per item - Sales Tax (none) _ Learn more about checkout Payment Instructions As is-- no returns or refunds"}, {"ItemID": "1679311832", "Name": "Liberty Limited Treasures Beanie", "Category": ["Movies & Television", "Memorabilia", "Other Memorabilia"], "Currently": "$10.00", "First_Bid": "$10.00", "Number_of_Bids": "0", "Bids": null, "Location": "Chesapeake, Virginia", "Country": "USA", "Started": "Dec-18-01 08:25:52", "Ends": "Dec-25-01 08:25:52", "Seller": {"UserID": "sprtbeanie", "Rating": "556"}, "Description": "Liberty Limited Treasures Beanie Liberty by Limited Treasures is a beanie for the USA. Only 10,000 pieces were made, this is a highly sought after bear now. Very few are left in stock!!! Paypal and Credit Cards accepted. Buyer pays $5.00 shipping. NO RESERVE Buyer to pay $5.00 for shipping and handling. Click here to view my other auctions. Created by eBay Seller's Assistant Pro Visit Tidewater Sports and Collectibles today! Payment Details U.S. Shipping and Handling $5.00 Shipping Insurance per item - Sales Tax (4.500% if shipped to VA) _ Learn more about checkout Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1679314832", "Name": "TALBOTS~Wmns Dress Pants~W31\" L30\" NICE", "Category": ["Clothing & Accessories", "Women", "Misses", "Career", "Pants"], "Currently": "$5.99", "First_Bid": "$5.99", "Number_of_Bids": "0", "Bids": null, "Location": "Fox Cities, Wi", "Country": "USA", "Started": "Dec-18-01 08:40:48", "Ends": "Dec-25-01 08:40:48", "Seller": {"UserID": "sumgurl", "Rating": "160"}, "Description": "This is a pair of womans dress pants by Talbots in a size 12. The waist measures 31\" around and the inseam is 30\" long. The are Charcoal Gray in color. Very simple lines, small darts in the front and back, and cute little slits at the outside ankle. They are in excellent condition with years of good wear left in them! They are made of 65% Polyester, 32% Viscose, and 3% Spandex."}, {"ItemID": "1679315561", "Name": "Victoria Secret Size Small String Bikini", "Category": ["Clothing & Accessories", "Women", "Intimates", "Panties"], "Currently": "$3.00", "First_Bid": "$3.00", "Number_of_Bids": "0", "Bids": null, "Location": "Buffalo", "Country": "USA", "Started": "Dec-18-01 08:43:18", "Ends": "Dec-21-01 08:43:18", "Seller": {"UserID": "gsagun@aol.com", "Rating": "597"}, "Description": "Victoria Secret Size Small String Bikini Click picture to enlarge Description 100% cotton. Brand new. The label has been removed for selling purposes. This is beige with flowers Payment and Shipping Info Payment Options Money Order/Cashier's Check or Personal Check _ _ _ Shipping Fixed Shipping Charges.$0.75 (Domestic) $1.75 (International) Will Ship Internationally Quantity Available 1 If you are the winning bidder, please use my fast, easy, and secure checkout. Click the checkout button on the right. Enter your shipping address and other information so I can calculate a final price and ship your product quickly. andale andalecheckout About Grace's Corner Grace's Corner appreciates your business. Use the REAL selling tools a million sellers do - Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions Please see the item description for payment and checkout instructions."}, {"ItemID": "1679316544", "Name": "BEWITCHING RED SHEER LACE THONG PANTY~sz M", "Category": ["Clothing & Accessories", "Women", "Intimates", "Panties"], "Currently": "$2.99", "First_Bid": "$2.99", "Number_of_Bids": "0", "Bids": null, "Location": "Sunny Florida", "Country": "USA", "Started": "Dec-18-01 08:47:42", "Ends": "Dec-25-01 08:47:42", "Seller": {"UserID": "bryte-eyes", "Rating": "1808"}, "Description": "tIRedLac-m Please see this item and more like it in our eBay Store ! http://www.ebaystores.com/bryteeyes ~~Brand NEW~~ BEAUTIFUL ~ Floral Lace (stretch lace) Thong Panty with Scalloped Waist Elastic and Scalloped Elastic Leg Edges, a Dainty Venice Lace Butterfly Applique center front and a solid contrasting back. Panty has a hygienic cotton crotch . This is a very pretty panty...... check my auctions for MORE Panties! You are bidding on a Red Panty. SIZE: M 82% Nylon / 18% Spandex Will ship off hanger First Class $1. Due to the nature of this item, there is a no return policy in force (manufacturer defects are an exception). If you have questions, please email us. All Sales Are Final!! See our other items for auction! Terms : Contact needs to be made within 3 days of end of auction and payment needs to be received within 10 days of auction close. If payment has not been received within the 10 day limit, we will file the NonPayingBidder notice with eBay. You will then have 10 more days for payment to be received before we file for our credit on the auction. Negative feedback will be posted for all NonPaying Bidders. Shipping : Buyer will pay $1.00 shipping within the 48 Continental United States. We are not responsible for lost mail. If you would like insurance, please add $1.10. We will combine shipping charges if more than one auction is won (there is a 7 day limit). Payment : Prepay by Money Order , Cashiers Check , PayPal , BidPay , Billpoint , Visa/Master Card . Please allow 3 business days for shipping after receipt of payment, within the 48 Continental United States. Tax: Florida residents add 6% sales tax. Free Honesty Counters powered by Andale! Visit Bryte-Eyes today! Payment Details U.S. Shipping and Handling $1.00 Shipping Insurance per item (optional) $1.10 Sales Tax (6.000% if shipped to FL) _ Learn more about checkout Payment Instructions NONE"}, {"ItemID": "1679320966", "Name": "EVAN PICONE RED PLAID WOOL SKIRT SIZE 8", "Category": ["Clothing & Accessories", "Women", "Misses", "Career", "Skirts"], "Currently": "$9.99", "First_Bid": "$9.99", "Number_of_Bids": "0", "Bids": null, "Location": "Central Illinois", "Country": "USA", "Started": "Dec-18-01 09:08:28", "Ends": "Dec-28-01 09:08:28", "Seller": {"UserID": "dolls-n-tiques", "Rating": "2387"}, "Description": "This is a great Evan Picone Red plaid wool skirt. It is perfect for the winter season! Perfect for the office or for any occasion! Skirt to be worn anywhere-anytime! 100% Wool Size 8 label reads: Evan Picone Size -- 8 100% wool Dry Clean Only measurements are : Length -- 25 inches Waist -- 27 inches (no Elastic) Hips -- 42 inches All measurements are approximate Great Looking Skirt! Nice bright red plaid ,Pleated, Great Evan Picone quality and style! Flattering & Versatile! Just throw on a Blazer, Sweater or Blouse and you are good to go! So versatile-wear anywhere & anytime!!! Very Good Condition. This Skirt is ready to wear. A perfect addition to your wardrobe! A Basic! This is a no reserve auction! US Buyer to pay Priority Mail of $3.95 (New Postage rates). International buyer to pay actual costs incurred. Please email if you have any questions. Please check out our other auctions & as always we will combine items to save on postage. Thank You For Looking & Good Luck Bidding! Visit DOLLS-N-TIQUES today! Payment Details U.S. Shipping and Handling $3.95 Shipping Insurance per item (optional) $1.10 Sales Tax (none) _ Learn more about checkout Payment Instructions We back what we sell!"}, {"ItemID": "1679321355", "Name": "2002 FIRST EDITION / CUSTOM 69 CHEVY/LOT OF 2", "Category": ["Toys & Hobbies", "Diecast, Toy Vehicles", "Cars, Trucks-Diecast", "Hot Wheels", "Modern (1980-Now)", "First Editions"], "Currently": "$2.00", "First_Bid": "$2.00", "Number_of_Bids": "0", "Bids": null, "Location": "ARIZONA PLEASE SEE MY OTHER AUCTION'S", "Country": "USA", "Started": "Dec-18-01 09:09:35", "Ends": "Dec-21-01 09:09:35", "Seller": {"UserID": "247", "Rating": "862"}, "Description": "YOU ARE BIDDING ON THE HOTWHEELS 2002 FIRST EDITION CUSTOM 69 CHEVY (LOT OF 2). BUYER TO PAY 3.50 PRIORITY MAIL. MONEY ORDER TO BE RECEIVED WITHIN 10 DAYS OF AUCTION'S END. I ALSO EXCEPT PAYPAL. THANK YOU AND GOOD LUCK. Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1679322705", "Name": "WOMENS SIZE M LIMITED SWEATER ~CUTE~", "Category": ["Clothing & Accessories", "Women", "Misses", "Casual", "Sweaters"], "Currently": "$4.00", "First_Bid": "$4.00", "Number_of_Bids": "0", "Bids": null, "Location": "OHIO", "Country": "USA", "Started": "Dec-18-01 09:15:50", "Ends": "Dec-21-01 09:15:50", "Seller": {"UserID": "clothes*shoppe", "Rating": "946"}, "Description": "WOMENS SIZE M LIMITED SWEATER ~CUTE~ YOU ARE BIDDING ON A SIZE MEDIUM LIMITED SWEATER..IT IS 37 % WOOL 37%ACRYLIC 26% NYLON..IT IS GREY WITH VLUE AND WHITE STRIPES..IT IS VERY NICE........ ..(UNLESS STATED IN AUCTIONS DESCRIPTION..ALL ITEM ARE IN GREAT SHAPE \"GENTLY WORN\") ..WE ACCEPT PAYPAL, CHECKS AND MONEY ORDERS.CHECKS WILL BE HELD FOR AT LEAST 7 BUSINESS DAY...PAYMENT MUST BE RECIEVED WITHIN 7 DAYS.SHIPPING WILL BE 4.50..WE HAVE JUST STARTED TO SHIP INTERNATIONALLY..THE SHIPPING WILL BE MORE AND ACUTAL.....WE DO COMBINE SHIPPING ON MULTIPLE AUCTIONS WON......THANKS FOR LOOKING AND HAPPY BIDDING..PLEASE FEEL FREE TO EMAIL ME FOR A BETTER PICTURE FOR SOME REASON WHEN I LOAD THEM INTO EBAY THE DON'T COME OUT AS GOOD..THANKS AGAIN NO RESERVE Click here to view my other auctions. This listing created by eBay Seller's Assistant Pro Visit grandmas_bargains today! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1679323860", "Name": "Pretty Maternity pants, blouse & dress L@@K", "Category": ["Clothing & Accessories", "Women", "Maternity", "Career", "Pants"], "Currently": "$6.50", "First_Bid": "$6.50", "Number_of_Bids": "0", "Bids": null, "Location": "Nashville", "Country": "USA", "Started": "Dec-18-01 09:22:10", "Ends": "Dec-21-01 09:22:10", "Seller": {"UserID": "mayfieldfan@juno.com", "Rating": "86"}, "Description": "The blouse is by \"Motherhood\" SZ. Med. The tag is cut off, unsure what it is made of. Hand wash or Dry Clean only. White Blouse with short sleeves and button down front. Can be worn with either the dress or the pants. Pants are from \"In Due Time\" SZ. Large. They are black with elastic waist. No Maternity panel. 100% polyester. Dress is from \"Take Nine Maternity\" SZ. 8. Dress is Turquoise with white decorative buttons down the front. Long sleeved. Didn't like collar that was on the dress, so cut it off and wear it with the white blouse. Other than the cut-off collar, items are like new. Come from SMOKE FREE home. No tears, rips or stains. I accept paypal, check or money order. Checks must clear before I ship. Shipping is $6.00 priority mail. Check our other auctions and we will combine shipping. Use the \"Buy it now\" feature by Thursday and pay for the item using Paypal the same day, I will ship Thursday. Good luck and have a Blessed Holiday! Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1679324058", "Name": "BEAUTIFUL RALPH LAUREN SILK/CASHMERE TOP NWT", "Category": ["Clothing & Accessories", "Women", "Misses", "Casual", "Sweaters"], "Currently": "$20.00", "First_Bid": "$20.00", "Number_of_Bids": "0", "Bids": null, "Location": "CLARKSVILLE", "Country": "USA", "Started": "Dec-18-01 09:21:57", "Ends": "Dec-23-01 09:21:57", "Seller": {"UserID": "teneele", "Rating": "41"}, "Description": "THIS IS A RALPH LAUREN 70%SILK AND 30%CASHMERE TANK SIZE SMALL THIS SHIRT IS NEW WITH THE TAGS. THIS IS A TANK TOP BUT IT IS SWEATER MATERIAL, LIGHT WEIGHT AND EXTREMELY SOFT!! THIS SHIRT IS SOLID BLACK AND RETAILS FOR 140.00. BUYER PAYS 4.50 SHIPPING. Free Honesty Counters powered by Andale! Visit SADIES NAME BRANDS FOR LESS today! Payment Details U.S. Shipping and Handling $4.50 Shipping Insurance per item (optional) $1.10 Sales Tax (none) _ Learn more about checkout Payment Instructions IF YOU WOULD LIKE TO PAY VIA PAYPAL OR BILLPOINT JUST CLICK THE LOGO ON THIS PAGE. IF YOU WOULD LIKE TO MAIL ME PAYMENT MY ADDRESS WILL BE AVAILABLE. THANK YOU."}, {"ItemID": "1679324439", "Name": "ORGANZA by GIVENCHY", "Category": ["Clothing & Accessories", "Personal Care", "Fragrances: Women", "Other Items"], "Currently": "$2.50", "First_Bid": "$2.50", "Number_of_Bids": "0", "Bids": null, "Location": "WAREHOUSE", "Country": "USA", "Started": "Dec-18-01 09:23:39", "Ends": "Dec-28-01 09:23:39", "Seller": {"UserID": "partsgrrl", "Rating": "671"}, "Description": "THIS WAS A GIFT. I USED IT TWICE. I NO LONGER WEAR PERFUME.ITS IN EXCELLENT CONDITION. I DONT KNOW HOW MANY OZ IT IS. THE BOTTLE IS 2.5\" LONG.ITS PERFECT AS PURSE SIZE. Payment Details U.S. Shipping and Handling $2.50 Shipping Insurance per item - Sales Tax (none) _ Learn more about checkout Payment Instructions WE PREFER PAYMENTS THRU PAYPAL AND BILLPOINT. Payments mailed must be received in 7 days after auction closes. no exceptions."}, {"ItemID": "1679324758", "Name": "CUTE North Pole Christmas Reindeers Sweater", "Category": ["Clothing & Accessories", "Women", "Misses", "Casual", "Sweaters"], "Currently": "$9.99", "First_Bid": "$9.99", "Number_of_Bids": "0", "Bids": null, "Location": "Central Ohio(See my other auctions)", "Country": "USA", "Started": "Dec-18-01 09:25:21", "Ends": "Dec-25-01 09:25:21", "Seller": {"UserID": "bibliotheque", "Rating": "574"}, "Description": "An adorable Designers Originals Studio Theme Sweater decorated with Northern Lights, the North Pole at Christmas and Reindeers. It is in excellent condition and is made of 55% Ramie and 45% Cotton. The Sweater is marked L and measures approximately 42\" around under the arms, 20\" from the top of the shoulder to the bottom edge and has 18\" long arms measured from the shoulder to the end of the cuff. See my other sweater auctions. Buyer to pay shipping. PAYPAL payment preferred but will accept personal checks or money order. Payment to be received within 10 days of the close of the auction. \" \" Free Honesty Counters powered by Andale! Payment Details U.S. Shipping and Handling $5.99 Shipping Insurance per item - Sales Tax (none) _ Learn more about checkout Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1679330690", "Name": "Set of 4/ 2000 First editions", "Category": ["Toys & Hobbies", "Diecast, Toy Vehicles", "Cars, Trucks-Diecast", "Hot Wheels", "Modern (1980-Now)", "First Editions"], "Currently": "$5.00", "First_Bid": "$5.00", "Number_of_Bids": "0", "Bids": null, "Location": "Ohio Hills", "Country": "USA", "Started": "Dec-18-01 09:51:05", "Ends": "Dec-25-01 09:51:05", "Seller": {"UserID": "suburan65@yahoo.com", "Rating": "106"}, "Description": "Set of 4 2000 First editions. Deora II, #5 of 36 cars, Deuce Roadster, #6 of 36 cars, Thomassima 3, #10 of 36 cars, Surf Crate, #13 of 36 cars. MIP. Any questions, please contact me. I have other Hot Wheels up for auction, please take a look. I accept Paypal. Free Honesty Counters powered by Andale! Visit KJ's Collectables today! Payment Details U.S. Shipping and Handling $3.95 Shipping Insurance per item (optional) $1.10 Sales Tax (none) _ Learn more about checkout Payment Instructions Payment is due within 10 days of close of auction. Always buying as is."}, {"ItemID": "1679332084", "Name": "Victoria's Secret $110 Ruching Halter Dress S", "Category": ["Clothing & Accessories", "Women", "Misses", "Casual", "Dresses", "Sleeveless"], "Currently": "$7.99", "First_Bid": "$7.99", "Number_of_Bids": "0", "Bids": null, "Location": "Check My auctions for More VS Daily!!", "Country": "USA", "Started": "Dec-18-01 09:55:53", "Ends": "Dec-25-01 09:55:53", "Seller": {"UserID": "findingit4u", "Rating": "1104"}, "Description": "Victoria's Secret $110 Ruching Halter Dress S Description The halter dress with a daring plunge front and a low-cut back. Adjustable drawstring creates ruching Imported rayon/poly/spandex. 26\" from waist color--Black Size--S Condition--Like New Maker--Hugo Buscati Payment and Shipping Info Payment Options Credit Card, Money Order / Cashier's Check, PayPal Shipping/Handling Rate $4.35 Insurance Rate See Item Description Shipping Options USPS Priority Mail Sales Tax 0% for in-state buyers / 0% for out-of-state buyers Terms We do not measure other than inseam. To view a VS size chart, Please see the ME page I am in no way associated with any famous maker or their products I will sell to U.S.A ONLY- I am sorry but due to problems with International Bidders I can no longer accept International Bids. Payment MUST BE recieved and in my hands within 10 days of auction end. If I do not recieve payment within 10 days I WILL file a NPBA with eBay. If you are bidding on several auctions, you have 4 days to combine shipping. But I still need to hear from you within 4 days. Failure to respond to my WB email and confirm the purchase within 3 days will result in a Payment notice reminder. Shipping Charges If your first item is... Clothing-- $4.35 Shoes--$5.00 Boots $7.00 Robes--$5.50 Ad $1.00 each additional item purchased at the same time within 4 days. If Combining shipping, ALL Items MUST be purchased at the SAME TIME to combine, if you make two or more SEPRATE payments through Paypal or Billpoint, it will go out as SEPERATE orders, and you will have to pay FULL shipping on BOTH. PLEASE Pay for you whole order at the SAME TIME.*** I will Ship Internationally but All tags have been defaced or marked out as required by the manufacturer. Items may be wrinkled, have small smudges,picked up scents from other items as well as lint due to being boxed, and handled. Shoes will have an X marked on the sole to indicate that they are a catalogue return. Please see About ME page For Important information. And a Size Chart Refunds and Returns are NOT accepted , unless the there was an error in the listing. All items sold as is and as described. Please feel free to email me with any questions you may have BEFORE you place a bid NO PERSONAL CHECKS-Payment by Money Order, Paypal or Billpoint Only! Visit Findingit4u today! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1679333482", "Name": "Bill Blass Blue Jeans Size 10L 10 Long VCG", "Category": ["Clothing & Accessories", "Women", "Misses", "Casual", "Jeans"], "Currently": "$4.99", "First_Bid": "$4.99", "Number_of_Bids": "0", "Bids": null, "Location": "I SHIP FAST!", "Country": "USA", "Started": "Dec-18-01 10:02:09", "Ends": "Dec-25-01 10:02:09", "Seller": {"UserID": "pieceandlove", "Rating": "37"}, "Description": "These have been washed twice and are in very good condition, no stains, holes, fraying. Dark blue, classic fit, tapered leg. Waist measures about 29\", inseam about 30\". Please feel free to email with any questions. I will combine shipping to save you money on any of my other auctions. Paypal or money orders are accepted. Shipping Priority is $3.95. Free Honesty Counters powered by Andale! Payment Details U.S. Shipping and Handling $3.95 Shipping Insurance per item (optional) $1.10 Sales Tax (0.000% if shipped to none) _ Learn more about checkout Payment Instructions Paypal or money order."}, {"ItemID": "1679336271", "Name": "Mage Knight Sealed Case Alpha Boosters", "Category": ["Toys & Hobbies", "Games", "Miniatures", "Mage Knight"], "Currently": "$9.99", "First_Bid": "$9.99", "Number_of_Bids": "0", "Bids": null, "Location": "Blaine, Mn", "Country": "USA", "Started": "Dec-18-01 10:11:48", "Ends": "Dec-25-01 10:11:48", "Seller": {"UserID": "hobbyheroes.com", "Rating": "7269"}, "Description": "Mage Knight Sealed Case Alpha Boosters Click here to learn more about Hobbyheroes.com ! You can email us at ebay@hobbyheroes.com , also, if you're interested in our other auctions currently on sale here on eBay, just jump on over to our listings page for more information! The sealed factory ALPHA box contains 48 boosters with 5 figures in each, including some miniatures which have already achieved collector status. Shipping cost for this auction is: $14.99 Approximate Shipping and Handling Charges: Single Cards: $2.99 for the first and $.50 for each additional. Card Boxes: $6.95 to $9.95 for the first and $2 for each additional. Card Box Cases: $12.95 to $29.95 for the first and $4 for each additional. Beanie Babies/Video Games: $4.99 for the first and $1.00 for each additional. Misc. Items: Please view item description for accurate shipping and handling charges. Additional shipping and handling charges will apply for out of the United States Orders. Insurance of $4.00 should also be included if desired. Remember, insurance is OPTIONAL Click here to see my other auctions! Minnesota residents are required to pay 6.5% sales tax. Created by eBay Seller's Assistant Pro"}, {"ItemID": "1679339995", "Name": "COCO CHANEL 3.4oz EDT SPRAY $85 Retail *NEW*", "Category": ["Clothing & Accessories", "Personal Care", "Fragrances: Women", "Chanel"], "Currently": "$55.00", "First_Bid": "$55.00", "Number_of_Bids": "0", "Bids": null, "Location": "LA, CA", "Country": "USA", "Started": "Dec-18-01 10:29:42", "Ends": "Dec-25-01 10:29:42", "Seller": {"UserID": "strawberryapple", "Rating": "2455"}, "Description": "COCO CHANEL Items are NEW and have never been used or tested. You will be receiving: 1 COCO Chanel Eau de Toilette spray ( 3.4 oz ) Retails for $85.00 comes unboxed no top 1 COCO Eau de Toilette Vial ( 0.12 fl oz / 4ml ) $2.00 Shipping!! Will also Insure for FREE!!! Items shipped within 24 hours of receipt of Paypal or M.O. payment!! Please see my other auctions for great deals on designer fragrances and cosmetics Payment Options: I accept PayPal, Money Order, Cashier's Check, and Personal Check ."}, {"ItemID": "1679340001", "Name": "Russ Sport Jeans Size 10 Neat!", "Category": ["Clothing & Accessories", "Women", "Misses", "Casual", "Jeans"], "Currently": "$7.99", "First_Bid": "$7.99", "Number_of_Bids": "0", "Bids": null, "Location": "I SHIP FAST!", "Country": "USA", "Started": "Dec-18-01 10:31:34", "Ends": "Dec-23-01 10:31:34", "Seller": {"UserID": "pieceandlove", "Rating": "37"}, "Description": "Original Russ Sport Jean Company medium blue color jeans in a size 10. Waist 28 1/2\", inseam 30\". Neat pattern, straight leg, not tapered, flat front. Great condition, only slight wash wear.............. Please feel free to email with any questions. I will combine shipping to save you money on any of my other auctions. Paypal or money orders are accepted. Shipping Priority is $3.95. Click on a picture to enlarge ') //-- ') //-- Free Honesty Counters powered by Andale! Payment Details U.S. Shipping and Handling $3.95 Shipping Insurance per item (optional) $1.10 Sales Tax (none) _ Learn more about checkout Payment Instructions Paypal or money order."}, {"ItemID": "1679340420", "Name": "LANCOME **RENERGIE** EYE CREME - NEW", "Category": ["Clothing & Accessories", "Personal Care", "Other Items"], "Currently": "$19.99", "First_Bid": "$19.99", "Number_of_Bids": "0", "Bids": null, "Location": "Jersey Shore", "Country": "USA", "Started": "Dec-18-01 10:31:39", "Ends": "Dec-25-01 10:31:39", "Seller": {"UserID": "beaniegram2000", "Rating": "2581"}, "Description": "This auction is for a BRAND NEW, NEVER USED FULL-SIZE JAR of **RENERGIE** EYE CREME, by LANCOME. This jar sells for $45.00+ Size: .5 fl.oz. Winner please add $4.50 S&H (for U.S. Shipping). Check out our other auctions for more LANCOME PRODUCTS and to save on S&H charges. THANKS FOR BIDDING! Paypal payments not accepted for International shipments."}, {"ItemID": "1679340512", "Name": "UNIQUE TURQ. APPLIQUE WOMEN'S VEST - MINT", "Category": ["Clothing & Accessories", "Women", "Misses", "Casual", "Vests"], "Currently": "$9.99", "First_Bid": "$9.99", "Number_of_Bids": "0", "Bids": null, "Location": "Southern California", "Country": "USA", "Started": "Dec-18-01 10:31:54", "Ends": "Dec-25-01 10:31:54", "Seller": {"UserID": "mashta50", "Rating": "488"}, "Description": "UNIQUE TURQ. APPLIQUE WOMEN'S VEST - MINT You are bidding on a mint condition turquoise Opus 1 women's applique vest in a one-size fits all. This vest was purchased by me in Mexico in the late 70's and worn maybe once. It is made of 100% cotton and is one of a kind decorated with multiple sizes, shapes and colors of material & stitching. Although it says \"one size fits all\", we know that's a myth, so the measurements are bust: 38 in. & length: 20 in. NO RESERVE I accept Visa & M/C through PayPal as well as money orders or cashiers checks. No personal checks please. Buyer to pay $4.00 for shipping. Please click here to see my other auctions. Free counters provided by Honesty.com This listing created by eBay Seller's Assistant Pro Payment Details U.S. Shipping and Handling $4.00 Shipping Insurance per item - Sales Tax (none) Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1679343464", "Name": "R&T 1/25 Red&White Samba,VW Beatle,Trl", "Category": ["Toys & Hobbies", "Diecast, Toy Vehicles", "Cars, Trucks-Diecast", "Maisto"], "Currently": "$18.99", "First_Bid": "$18.99", "Number_of_Bids": "0", "Bids": null, "Location": "Scottdale,Pa.15683", "Country": "USA", "Started": "Dec-18-01 10:44:32", "Ends": "Dec-25-01 10:44:32", "Seller": {"UserID": "bigaljal", "Rating": "4037"}, "Description": "New as shown. Add $6.50 S&H in US, More outside US. I'll give a break on S&H if more than 1 lot is won. money orders (ship next day)or checks(ship after 10 days. $25.00 fee for bad checks). Your choice of payment . Please include a copy of this notice or hand written description with your payment.Insurance is $1.10 extra but it's optional."}, {"ItemID": "1679346613", "Name": "RARE JAPENEESE SPEAKING FURY MINT IN BOX 1998", "Category": ["Toys & Hobbies", "Electronic, Battery, Wind-Up", "Electronic, Interactive", "Furby"], "Currently": "$12.99", "First_Bid": "$12.99", "Number_of_Bids": "0", "Bids": null, "Location": "PASADENA MD", "Country": "USA", "Started": "Dec-18-01 10:55:23", "Ends": "Dec-25-01 10:55:23", "Seller": {"UserID": "kjmoroz111@aol.com", "Rating": "942"}, "Description": "THIS IS A GREAT COLLECTORS ITEM AS IT FEATURES A 1998 FURBY MINT IN BOX NEVER OPENED AND HE SPEAKS IN JAPENEESE ONLY NOT ENGLISH AS MOST DO HE IS GRAY WITH PINK EARS AND MADE IN 1998 AND AS STATED HE IS IN MINT CONDITION UNOPENED A GREAT ADDITION TO ANY COLLECTION AS THESE ARE HARD TO GET ESPICALLY UNOPENED WINNING BIDDER PAYS SHIPPING OF 4.50 IN THE U.S WE ACCEPT PAYPAL BILLPOINT MONEY ORDERS OR CHECKS HELD FOR 7 DAYS THANKS FOR LOOKING"}, {"ItemID": "1679347417", "Name": "BLUE ICE Vegetable Glycerin Lge Bar Soap PIC", "Category": ["Clothing & Accessories", "Personal Care", "Body Care", "Soap"], "Currently": "$4.45", "First_Bid": "$4.45", "Number_of_Bids": "0", "Bids": null, "Location": "Sunny California", "Country": "USA", "Started": "Dec-18-01 10:58:38", "Ends": "Dec-25-01 10:58:38", "Seller": {"UserID": "simplyus", "Rating": "590"}, "Description": "SIT BACK AND RELAX...SHOP at HOME... This is a great time to purachase your New Year's, Special Occasion, Anniversary, Birthday, Fall, Winter, and Holiday shopping! SIMPLYUS PRESENTS ~~~~~~~~~~~~~ INTRODUCTORY OFFER!!!! Our Own Line Of Vegetable Glycerin Soaps! ~ SIMPLYUS SOAPS~ BLUE ICE PURE NATURAL VEETABLE GLYCERIN SOAP! THIS IS MY LAST ONE!! AWESOME! YOU WILL LOVE THIS SOAP! Men especially love this scent This is what I call a big bar of the \"BLUE ICE SOAP! These bars will weigh about 7 ozs. and up! It is so big, I usually cut my soap bars in half! They keep the smell and freshness in for a long time! They make wonderful gift and are great for travel too! All of the Simplyus soaps contain vegetable glycerin which will give you a rich lather and it moisturizes the skin at the same time. Simplyus soaps have been made by hand, with wonderful rich and pure essential oils and with many of the popular fragrance oils. I know you will love how wonderful your skin feels after you use the soap. I also love the wonderful scent that lingers in my bathroom after I have used this great soap. WOW... BLUE ICE... This is a wonderful pure vegetable glycein bar of soap. With scent of Patchouli, Musk, Sandalwood, and fresh wood, no one could resist this wonderful scent!! A wonderful cleansing bar of soap! I love it, and so will you. Even women buy this soap for themselfs and Men love the original scent!Everyone will love this scent... Men will love it..Women can't resist it!... A great refreshing scent that will make you feel wonderful all over! You will love this scent! So remember, after a long day at work or play, treat yourself or a friend and indulge in the wonderful essence of these SIMPLYUS Soaps. I know you will love using this soap or giving it for a wonderful, hit of the party, gift. This is my last one that I have made, so let the bidding begin! There is NO RESERVE, and I have started the bidding low enough (below my cost,) so everyone can join in. Please e-mail me with any questions you may have. Please check out the other items I have listed. (View Seller's Other Auctions) Items can be combined to save on shipping. Winning bid pays for the S&H, and insurance, if desired. We accept checks, M.O., and cashier checks. Check purchases will be held 10 days for the check to clear. Thank you for looking... and .... Happy Bidding! Simplyus E-mail Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1679347444", "Name": "RED 3/4 LENGTH SLEEVE SWEATER~LIKE NEW~CUTE", "Category": ["Clothing & Accessories", "Women", "Misses", "Casual", "Sweaters"], "Currently": "$8.99", "First_Bid": "$8.99", "Number_of_Bids": "0", "Bids": null, "Location": "PAYPAL PREFERRED", "Country": "USA", "Started": "Dec-18-01 10:58:50", "Ends": "Dec-25-01 10:58:50", "Seller": {"UserID": "kokanee44", "Rating": "175"}, "Description": "You are bidding on a Ship'n Shore brand, red 3/4 length sleeve sweater, size Large. It is make of 55% acrylic and 45% cotton. It is in EXCELLENT condition, like new. TERMS: BIDDERS WITH AN EBAY FEEDBACK RATING OF 10 OR LOWER MUST CONTACT ME WITHIN 3 DAYS WITH THEIR METHOD OF PAYMENT AFTER AUCTION CLOSE. After 3 days I will relist the item. I'm sorry, but I have had too many problems with this issue. Winning bidder agrees to pay $3.50 priority shipping and agrees to pay within seven (7) days of auction's end. Insurance is optional. I DO NOT ACCEPT BILLPOINT, sorry. I PREFER PAYPAL. I also accept Money Orders and Cashiers Checks. A Personal Check is also accepted and is held until it clears my bank. There are some exceptions to that rule: I will ship before clearing based on the buyers feedback rating on eBay, the item itself or the price of the item. This is all based on my discretion. PayPal E-Check purchases will be shipped when PayPal clears the transaction, usually 3-5 working days. Please read description carefully, as all sales are FINAL. I want to answer all your questions and I especially want you to be pleased with your purchase! All items come from a Smoke and Pet Free Home. Please feel free to shop my other auctions to save on shipping. God Bless and Good Luck!!! SERIOUS PAYING BIDDERS ONLY! CLICK ON THE PAYPAL LOGO IN MY AUCTION TO PAY ME QUICKLY AND SECURELY WITH A CREDIT CARD OR CHECKING ACCOUNT."}, {"ItemID": "1679366294", "Name": "Hot Wheels Turbo Streak Indy Car 3914-g LE", "Category": ["Toys & Hobbies", "Diecast, Toy Vehicles", "Cars, Trucks-Diecast", "Hot Wheels", "Modern (1980-Now)", "Other"], "Currently": "$2.99", "First_Bid": "$2.99", "Number_of_Bids": "0", "Bids": null, "Location": "Ohio....The Diecast State....", "Country": "USA", "Started": "Dec-18-01 12:06:05", "Ends": "Dec-25-01 12:06:05", "Seller": {"UserID": "slvr@aol.com", "Rating": "2356"}, "Description": "Hot Wheels 1/64th scale diecast. 1994 Shell Oil Company Promotional series. Issue #3914-g Turbo Streak Indy car in Yellow enamel. Unpainted metal spoilers/interior. Chrome Basic wheels. Unpainted metal \"Malaysia\" base. Shell logo & stripes tampos. This item is MINT(see picture, Please note that the white spot(s)that MAY appear on the item in the picture IS GLARE FROM THE PHOTO LIGHT BULBS and not flaws or chips, If an item has any known flaws they will be listed)****NO RESERVE**** Winning bidder pays insured shipping costs & may combine other winning auctions to save on shipping. U.S.Residents terms of payment: Personal checks, Cash, Money Orders, Cashier Check, Postal Money Orders, or \"Western Union Bidpay\" electronic check. Overseas & International bidders payment terms: Cash in U.S.Dollars, or International Postal Money Orders. PLEASE NOTE: Serious Variation collectors. These are from one of the largest PERSONAL (35+ years) diecast collections of Variations in the country, so please read descriptions details and compare as you may not have it! and many items there are only ONE! Please check out my many Hot Wheels Matchbox Racing Champions & Johnny Lightning auctions. Thanks & Good Luck! Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1679386982", "Name": "NEW HOT WHEEL/S CAR CASE PRESCHOOL TOY LOOK", "Category": ["Toys & Hobbies", "Diecast, Toy Vehicles", "Cars, Trucks-Diecast", "Hot Wheels", "Modern (1980-Now)", "Other"], "Currently": "$3.99", "Buy_Price": "$13.99", "First_Bid": "$3.99", "Number_of_Bids": "0", "Bids": null, "Location": "salt lake city", "Country": "USA", "Started": "Dec-18-01 13:18:34", "Ends": "Dec-23-01 13:18:34", "Seller": {"UserID": "seeandbuy!", "Rating": "265"}, "Description": "This is a brand new hot wheels car carrying case It is really perfect for the little 3.4 5 year old (preschoolers) who wants to have hot wheel car case like his big brother or big friends.Decorated with a red, blue and black 3d effect _car that looks like a guitar shape says \"twang thang\" ... even my 9 year old son thought this was pretty cool-- this would be great for a musicians child. Big enought compartment to_hold an extra long car... See how the carrying handle moves up and down to make it_more compact?? It is brand new, mint in every way.... came right from the store into our non smoking home...Really, really cute and compact. Nice too, to take to the restaurant and keep a little one occupied. It has a retractable silver handle.. THe measurements are : 10 inches long 3 inches high 2 inches deep.. See what I mean about it being perfect for a littler person? I had never seen one this small, tidy and compact _until today while I was out shopping.) It is a cool little 6 car carrying case. Small enough to fit into a diaper bag or larger purse or let your little guy or girl carry. It holds 6 cars. Small enough /discrete enough to let them take when they need to be still and be occupied. (My nephew will be taking this to a wedding this December. Your little one will feel like a \"big boy\" or \"big girl\" ... hot wheel cars aren't just for boys, my little girl had her own collection... shipping is low cost .. $2.00.... Bid now ...use paypal,billpoint or money order.. and thanks for looking and check out the buy it now price! Free Honesty Counters powered by Andale! Visit A See and Buy It Store today! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions shipping instructions are given in auction you can use seeandbuyit@aol.com for paypal."}, {"ItemID": "1679391688", "Name": "Jiffy Lube Scorchin Scooter", "Category": ["Toys & Hobbies", "Diecast, Toy Vehicles", "Cars, Trucks-Diecast", "Hot Wheels", "Modern (1980-Now)", "Other"], "Currently": "$9.00", "Buy_Price": "$11.53", "First_Bid": "$9.00", "Number_of_Bids": "0", "Bids": null, "Location": "Give me Liberty or give me Death !", "Country": "USA", "Started": "Dec-18-01 13:36:16", "Ends": "Dec-23-01 13:36:16", "Seller": {"UserID": "minicycles", "Rating": "236"}, "Description": "HotWheels Jiffy Lube Scorchin Scooter black, yellow/blue/orange flames, red seat, gold chrome wheels & handle bars. Mint on card. A very nice collectible motorcycle. Successful bidder pays $4.50 priority shipping-delivery confirmation. Insurance extra if requested. Please check out my other Scorchin Scooter, Blast Lanes Motorcycles and Matchbox Harley Davidson Motorcycles & related items up for auction bid accordingly and save on your shipping charges. Thank You & Ride Safe Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1679400806", "Name": "Sea Kings' Blessing Legends Mint NBP", "Category": ["Toys & Hobbies", "Games", "Magic, Gaming Cards (CCG)", "Magic the Gathering", "Individual Cards"], "Currently": "$1.00", "First_Bid": "$1.00", "Number_of_Bids": "0", "Bids": null, "Location": "Loveland, CO", "Country": "USA", "Started": "Dec-18-01 14:08:58", "Ends": "Dec-25-01 14:08:58", "Seller": {"UserID": "darwin-five", "Rating": "193"}, "Description": "This is Sea Kings' Blessing from the Legends Set in Mint NBP condition. I accept MO, personal and cashier checks, and PayPal. Shipping will be $1.00 Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1679434823", "Name": "HW Emergency Squad 51 Ambulance VHTF", "Category": ["Toys & Hobbies", "Diecast, Toy Vehicles", "Cars, Trucks-Diecast", "Hot Wheels", "Modern (1980-Now)", "Other"], "Currently": "$9.99", "First_Bid": "$9.99", "Number_of_Bids": "0", "Bids": null, "Location": "in the house", "Country": "USA", "Started": "Dec-18-01 16:14:32", "Ends": "Dec-23-01 16:14:32", "Seller": {"UserID": "diecasttoys", "Rating": "1442"}, "Description": "Hot Wheels Emergency Squad 51 get it while u can This is the limited edition Hot Wheels truck that celebrates the 30th Anniversary of Emergency Medical Services System. The car is based on the hit TV series Emergency! that aired in 1971 through 1978. Mint to near mint card. Shipping $4 Click below to... send me email: bobebay@yahoo.com Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1679455238", "Name": "Hot Wheels 2001 FE No. 36/36 Fandango", "Category": ["Toys & Hobbies", "Diecast, Toy Vehicles", "Cars, Trucks-Diecast", "Hot Wheels", "Modern (1980-Now)", "First Editions"], "Currently": "$0.01", "First_Bid": "$0.01", "Number_of_Bids": "0", "Bids": null, "Location": "In the Middle", "Country": "USA", "Started": "Dec-18-01 17:28:20", "Ends": "Dec-23-01 17:28:20", "Seller": {"UserID": "morefuntoys4me", "Rating": "4"}, "Description": "You are bidding on a brand new Hot Wheels 2001 First Edition Fandango No. 36/36. Collector No. 048. This is a 1:64 scale model car with great detail such as glitter paint, ground effects, chrome rims, and body graphics. This is becoming rare to find. This is a must have collectable for anyone who's into modified cars. Winning bidder pays $3.80 USPS shipping. I accept cashier checks or money orders only. Please DO NOT use EBay checkout, I will send payment instructions upon end of auction... Don't forget to check out my other auctions.. Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1679480995", "Name": "#246 Shadow Jet II uh", "Category": ["Toys & Hobbies", "Diecast, Toy Vehicles", "Cars, Trucks-Diecast", "Hot Wheels", "Modern (1980-Now)", "Other"], "Currently": "$1.50", "First_Bid": "$1.50", "Number_of_Bids": "0", "Bids": null, "Location": "Iowa", "Country": "USA", "Started": "Dec-18-01 18:49:56", "Ends": "Dec-23-01 18:49:56", "Seller": {"UserID": "jtvfeather", "Rating": "16"}, "Description": "You will be bidding on the #246 Shadow Jet II uh. Card is near mint. Buyer to pay $3.50 shipping and I will combine your items won. If your combined total from my auctions is $25 or more I will pay the shipping. Thanks for looking Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}]}
